var Facilities = [
    {
        name: "50", //设备名字
        width : 50, //宽度
        height : 50, //高度
        safe : { //安全距离
            left : 50,  //左侧安全距离
            right:  50, //右侧安全距离
            up : 50, //上侧安全距离
            down : 50 //下侧安全距离
        },
        cost: 100, //花费
        face: "0", //操作面朝向，"0"-上，"1"-右，"2"-下，"3"-左
        kind : 3 //类型，无需修改
    },
    {
        name: "100", //设备名字
        width : 100, //宽度
        height : 100, //高度
        safe : { //安全距离
            left : 50,  //左侧安全距离
            right:  50, //右侧安全距离
            up : 50, //上侧安全距离
            down : 50 //下侧安全距离
        },
        cost: 100, //花费
        face: "0", //操作面朝向，"0"-上，"1"-右，"2"-下，"3"-左
        kind : 3 //类型，无需修改
    },
    {
        name: "200", //设备名字
        width : 200, //宽度
        height : 200, //高度
        safe : { //安全距离
            left : 50,  //左侧安全距离
            right:  50, //右侧安全距离
            up : 50, //上侧安全距离
            down : 50 //下侧安全距离
        },
        cost: 100, //花费
        face: "1", //操作面朝向，"0"-上，"1"-右，"2"-下，"3"-左
        kind : 3 //类型，无需修改
    },
    {
        name: "100*50", //设备名字
        width : 100, //宽度
        height : 50, //高度
        safe : { //安全距离
            left : 50,  //左侧安全距离
            right:  50, //右侧安全距离
            up : 50, //上侧安全距离
            down : 50 //下侧安全距离
        },
        cost: 100, //花费
        face: "2", //操作面朝向，"0"-上，"1"-右，"2"-下，"3"-左
        kind : 3 //类型，无需修改
    },
    {
        name: "100*50", //设备名字
        width : 100, //宽度
        height : 50, //高度
        safe : { //安全距离
            left : 50,  //左侧安全距离
            right:  50, //右侧安全距离
            up : 50, //上侧安全距离
            down : 50 //下侧安全距离
        },
        cost: 100, //花费
        face: "2", //操作面朝向，"0"-上，"1"-右，"2"-下，"3"-左
        kind : 3 //类型，无需修改
    },
    {
        name: "100*50", //设备名字
        width : 100, //宽度
        height : 50, //高度
        safe : { //安全距离
            left : 50,  //左侧安全距离
            right:  50, //右侧安全距离
            up : 50, //上侧安全距离
            down : 50 //下侧安全距离
        },
        cost: 100, //花费
        face: "2", //操作面朝向，"0"-上，"1"-右，"2"-下，"3"-左
        kind : 3 //类型，无需修改
    },
    {
        name: "100*50", //设备名字
        width : 100, //宽度
        height : 50, //高度
        safe : { //安全距离
            left : 50,  //左侧安全距离
            right:  50, //右侧安全距离
            up : 50, //上侧安全距离
            down : 50 //下侧安全距离
        },
        cost: 100, //花费
        face: "2", //操作面朝向，"0"-上，"1"-右，"2"-下，"3"-左
        kind : 3 //类型，无需修改
    }
]


export default Facilities;