var Facilities = [
    {
        name: "高压设备1", //设备名字
        id: "GY3283832", //设备编号
        width : 50, //宽度
        height : 50, //高度
        safe : { //安全距离
            left : 10,  //左侧安全距离
            right:  20, //右侧安全距离
            up : 30, //上侧安全距离
            down : 40, //下侧安全距离
            operation: 0,
            back : 0
        },
        cost: 100, //花费
        face: "1", //操作面朝向，"0"-上，"1"-右，"2"-下，"3"-左
        kind : 3 //类型，无需修改
    },
    {
        name: "高压设备2", //设备名字
        id: "GY3283832",
        width : 100, //宽度
        height : 100, //高度
        safe : { //安全距离
            left : 50,  //左侧安全距离
            right:  50, //右侧安全距离
            up : 50, //上侧安全距离
            down : 50, //下侧安全距离
            operation: 50,
            back : 50
        },
        cost: 100, //花费
        face: "1", //操作面朝向，"0"-上，"1"-右，"2"-下，"3"-左
        kind : 3 //类型，无需修改
    },
    {
        name: "200", //设备名字
        id: "11",
        width : 200, //宽度
        height : 200, //高度
        safe : { //安全距离
            left : 50,  //左侧安全距离
            right:  50, //右侧安全距离
            up : 50, //上侧安全距离
            down : 50 //下侧安全距离
        },
        cost: 100, //花费
        face: "1", //操作面朝向，"0"-上，"1"-右，"2"-下，"3"-左
        kind : 3 //类型，无需修改
    },
    {
        name: "a", //设备名字
        id: "GY3283832",
        width : 100, //宽度
        height : 50, //高度
        safe : { //安全距离
            left : 50,  //左侧安全距离
            right:  50, //右侧安全距离
            up : 50, //上侧安全距离
            down : 50 //下侧安全距离
        },
        cost: 100, //花费
        face: "2", //操作面朝向，"0"-上，"1"-右，"2"-下，"3"-左
        kind : 3 //类型，无需修改
    },
    {
        name: "100*50", //设备名字
        id: "GY3283832",
        width : 100, //宽度
        height : 50, //高度
        safe : { //安全距离
            left : 50,  //左侧安全距离
            right:  50, //右侧安全距离
            up : 50, //上侧安全距离
            down : 50 //下侧安全距离
        },
        cost: 100, //花费
        face: "2", //操作面朝向，"0"-上，"1"-右，"2"-下，"3"-左
        kind : 3 //类型，无需修改
    },
    {
        name: "100*50", //设备名字
        id: "GY3283832",
        width : 100, //宽度
        height : 50, //高度
        safe : { //安全距离
            left : 50,  //左侧安全距离
            right:  50, //右侧安全距离
            up : 50, //上侧安全距离
            down : 50 //下侧安全距离
        },
        cost: 100, //花费
        face: "2", //操作面朝向，"0"-上，"1"-右，"2"-下，"3"-左
        kind : 3 //类型，无需修改
    },
    {
        name: "100*50", //设备名字
        id: "GY3283832",
        width : 100, //宽度
        height : 50, //高度
        safe : { //安全距离
            left : 50,  //左侧安全距离
            right:  50, //右侧安全距离
            up : 50, //上侧安全距离
            down : 50 //下侧安全距离
        },
        cost: 100, //花费
        face: "2", //操作面朝向，"0"-上，"1"-右，"2"-下，"3"-左
        kind : 3 //类型，无需修改
    }
]


export default Facilities;